Server1/src/main/resources/server1-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://teja.vin.com/service">
    <soapenv:Header/>
    <soapenv:Body>
        <us:WhichRequest>
            <us:serviceName>AddService</us:serviceName>
        </us:WhichRequest>
    </soapenv:Body>
</soapenv:Envelope>